# Panel Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Panel Class
Members See Also
---
This object represents a curtain panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Panel : FamilyInstance
```

Visual Basic
---
```text
Public Class Panel _
	Inherits FamilyInstance
```

Visual C++
---
```text
public ref class Panel : public FamilyInstance
```

# Remarks
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Instance Autodesk.Revit.DB..::..FamilyInstance Autodesk.Revit.DB..::..Panel
# See Also
Panel Members
Autodesk.Revit.DB Namespace